# Clean zipcode distances csv and export as JSON

## Imports

In [1]:
import pandas as pd

## Practice

In [8]:
car_data = pd.DataFrame({
    "Car make": 'Ferrari',
    "Colour": 'red'
}, index=[0])

In [9]:
car_data

  Car make Colour
0  Ferrari    red

## Load data

In [22]:
# Create dataframe with pandas
zipcode_dist_data_1 = pd.read_csv("./data/xab.csv")

## Explore data

In [23]:
# Number of (rows, columns)
zipcode_dist_data_1.shape

(249999, 3)

In [24]:
# Preview table
zipcode_dist_data_1.head(10)

   77971  77954  49.4699443579075
0  77971  77434         49.742710
1  77973  77990          4.935484
2  77973  77951          7.573285
3  77973  77905         13.960610
4  77973  77977         15.010409
5  77973  77960         16.586468
6  77973  78377         17.464803
7  77973  77950         17.940617
8  77973  77901         18.071969
9  77973  77988         20.998217

In [25]:
# Add column names
zipcode_dist_data_1.columns = ['zipcode_1', 'zipcode_2', 'distance']

In [26]:
# Look at column info
zipcode_dist_data_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 249999 entries, 0 to 249998
Data columns (total 3 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   zipcode_1  249999 non-null  int64
 1   zipcode_2  249999 non-null  int64
 2   distance   249999 non-null  float64
dtypes: float64(1), int64(2)
memory usage: 5.7 MB

In [27]:
# Check for missing values
zipcode_dist_data_1.isna().sum()

zipcode_1    0
zipcode_2    0
distance     0
dtype: int64

In [28]:
# Preview table
zipcode_dist_data_1.head()

   zipcode_1  zipcode_2   distance
0      77971      77434  49.742710
1      77973      77990   4.935484
2      77973      77951   7.573285
3      77973      77905  13.960610
4      77973      77977  15.010409

## Clean data

In [29]:
# Delete rows with column-one zip codes that are not in CA, ie greater than 90001
zipcode_dist_data_1.drop(zipcode_dist_data_1[zipcode_dist_data_1.zipcode_1 < 90001].index, inplace = True)

# https://stackoverflow.com/questions/13851535/how-to-delete-rows-from-a-pandas-dataframe-based-on-a-conditional-expression
# https://www.geeksforgeeks.org/drop-rows-from-the-dataframe-based-on-certain-condition-applied-on-a-column/
"""
https://www.freecodecamp.org/news/drop-list-of-rows-from-pandas-dataframe/
df.drop([5,6], axis=0, inplace=True)
[5,6] is the index of the rows you want to delete
axis=0 denotes that rows should be deleted from the dataframe
inplace=True performs the drop operation in the same dataframe
"""

In [30]:
# Number of (rows, columns)
zipcode_dist_data_1.shape

(84933, 3)

In [31]:
# Delete rows with column-two zip codes that are not vendor zip codes
vendorZips = [
  80132, 80301, 80465, 80501, 80907, 85395, 90010, 90016, 90042, 90048, 90201,
  90230, 90241, 90245, 90249, 90255, 90266, 90290, 90301, 90303, 90401, 90403,
  90504, 90505, 90605, 90620, 90623, 90638, 90650, 90660, 90701, 90712, 90713,
  90731, 90740, 90745, 90746, 90755, 90802, 90804, 90808, 91001, 91006, 91011,
  91016, 91023, 91025, 91040, 91042, 91101, 91103, 91105, 91106, 91107, 91203,
  91303, 91310, 91316, 91324, 91335, 91342, 91344, 91350, 91351, 91355, 91360,
  91367, 91384, 91387, 91390, 91405, 91502, 91504, 91604, 91702, 91709, 91710,
  91719, 91722, 91730, 91731, 91739, 91741, 91744, 91748, 91754, 91759, 91761,
  91767, 91773, 91784, 91786, 91791, 91801, 91901, 91906, 91910, 91916, 91948,
  91962, 91977, 92009, 92020, 92024, 92026, 92027, 92028, 92036, 92054, 92056,
  92064, 92065, 92069, 92075, 92083, 92084, 92109, 92110, 92111, 92115, 92126,
  92127, 92128, 92154, 92173, 92220, 92223, 92234, 92236, 92243, 92252, 92253,
  92260, 92284, 92305, 92314, 92315, 92317, 92321, 92325, 92333, 92335, 92336,
  92339, 92345, 92351, 92352, 92356, 92358, 92359, 92371, 92373, 92376, 92378,
  92382, 92391, 92392, 92397, 92399, 92401, 92404, 92405, 92408, 92410, 92449,
  92503, 92506, 92509, 92530, 92539, 92543, 92544, 92545, 92549, 92553, 92561,
  92562, 92570, 92571, 92590, 92592, 92595, 92624, 92626, 92630, 92647, 92648,
  92664, 92665, 92676, 92678, 92680, 92685, 92688, 92706, 92708, 92714, 92782,
  92801, 92802, 92805, 92806, 92879, 92886, 93001, 93003, 93010, 93015, 93022,
  93023, 93036, 93060, 93065, 93101, 93105, 93117, 93210, 93222, 93225, 93243,
  93252, 93254, 93304, 93306, 93401, 93422, 93436, 93441, 93446, 93454, 93460,
  93510, 93532, 93534, 93535, 93543, 93551, 93552, 93553, 93561, 93591, 93637,
  93930, 93940, 95020, 95422, 95834, 97230, 97478, 98001, 98002, 98003, 98004,
  98008, 98012, 98026, 98031, 98032, 98033, 98037, 98042, 98055, 98072, 98148,
  98199, 98223, 98272, 98366, 98375, 98383, 98407, 98424, 98444, 98467,
]

zipcode_dist_data_1 = zipcode_dist_data_1.query("zipcode_2 in @vendorZips")

# https://stackoverflow.com/questions/19960077/how-to-filter-pandas-dataframe-using-in-and-not-in-like-in-sql
# https://stackoverflow.com/questions/43269548/pandas-how-to-remove-rows-from-a-dataframe-based-on-a-list

In [32]:
# Number of (rows, columns)
zipcode_dist_data_1.shape

(23441, 3)

In [33]:
# Preview table
zipcode_dist_data_1.head(10)

        zipcode_1  zipcode_2  distance
165068      90001      90255  1.872821
165085      90001      90201  4.484633
165092      90001      90303  5.240103
165103      90001      90249  6.291307
165105      90001      90301  6.369897
165117      90001      90016  7.080508
165118      90001      90010  7.177897
165121      90001      90241  7.284691
165128      90001      90746  7.937149
165131      90001      91754  8.161111

In [35]:
# delete index column
zipcode_dist_data_1.reset_index(drop=True)

       zipcode_1  zipcode_2   distance
0          90001      90255   1.872821
1          90001      90201   4.484633
2          90001      90303   5.240103
3          90001      90249   6.291307
4          90001      90301   6.369897
...          ...        ...        ...
23436      91311      91748  45.804456
23437      91311      93252  46.472639
23438      91311      91773  47.034970
23439      91311      90740  47.754886
23440      91311      92801  48.454488

[23441 rows x 3 columns]

In [38]:
# Export to csv without index

zipcode_dist_data_1.to_csv("xab_clean.csv", header=False, index=False)

# https://stackoverflow.com/questions/60117334/how-to-remove-the-index-column-in-pandas
# https://stackoverflow.com/questions/16923281/writing-a-pandas-dataframe-to-csv-file
# https://www.geeksforgeeks.org/saving-a-pandas-dataframe-as-a-csv/

In [40]:
# Export dataframe to JSON 
zipcode_dist_data_1.to_json('xab_clean.json', orient='records')
# https://datatofish.com/export-pandas-dataframe-json/
# orient by column, row (records)

## CSV File #2

In [41]:
# Create dataframe with pandas
zip_2 = pd.read_csv("./data/xac.csv")

In [43]:
# Preview table
zip_2.head()

   91311  93591  49.5619469214655
0  91311  92841         49.892365
1  91311  90742         49.960204
2  91316  91436          1.646577
3  91316  91356          1.868290
4  91316  91406          2.827690

In [45]:
# Add column names
zip_2.columns = ['zipcode_1', 'zipcode_2', 'distance']

In [46]:
# Delete rows with column-one zip codes that are not in CA, ie greater than 96162
zip_2.drop(zip_2[zip_2.zipcode_1 > 96162].index, inplace = True)

In [48]:
# Number of (rows, columns)
zip_2.shape

(249999, 3)

In [49]:
# Delete rows with column-two zip codes that are not vendor zip codes
zip_2 = zip_2.query("zipcode_2 in @vendorZips")

In [50]:
zip_2.shape

(37630, 3)

In [51]:
zip_2.head()

    zipcode_1  zipcode_2  distance
6       91316      91335  3.120382
10      91316      91405  4.746460
18      91316      91303  5.546652
20      91316      91324  5.743113
21      91316      91367  5.850308

In [52]:
# Export to csv without index and header

zip_2.to_csv("xac_clean.csv", header=False, index=False)

In [53]:
# Export dataframe to JSON 

zip_2.to_json('xac_clean.json', orient='records')

## CSV File #3

In [54]:
# Create dataframe with pandas
zip_3 = pd.read_csv("./data/xad.csv")

In [58]:
# Preview table
zip_3.head()

   95968  95942  40.3746477858943
0  95968  95722         40.378114
1  95968  95659         40.985276
2  95968  95736         41.170377
3  95968  95936         41.202711
4  95968  95714         41.330279

In [59]:
# Add column names
zip_3.columns = ['zipcode_1', 'zipcode_2', 'distance']

In [60]:
# Delete rows with column-one zip codes that are not in CA, ie greater than 96162
zip_3.drop(zip_3[zip_3.zipcode_1 > 96162].index, inplace = True)

In [61]:
zip_3.shape

(6579, 3)

In [62]:
zip_3.head()

   zipcode_1  zipcode_2   distance
0      95968      95722  40.378114
1      95968      95659  40.985276
2      95968      95736  41.170377
3      95968      95936  41.202711
4      95968      95714  41.330279

In [63]:
# Export to csv without index and header

zip_3.to_csv("xad_clean.csv", header=False, index=False)

In [64]:
# Export dataframe to JSON 

zip_3.to_json('xad_clean.json', orient='records')

## Merge CSV Files

In [65]:
# Merge csv files

# https://www.freecodecamp.org/news/how-to-combine-multiple-csv-files-with-8-lines-of-code-265183e0854/

import os
import glob

In [68]:
# Use glob to match the pattern ‘csv’
# FAIL

extension = 'csv'
all_filenames = [i for i in glob.glob('*.{}'.format(extension))]

#combine all files in the list
combined_csv = pd.concat([pd.read_csv(f) for f in all_filenames ])

combined_csv

,91316,91335,3.1203821808121197,95968,95722,40.3781135036239,90001,90255,1.87282140474766
0,91316.0,91405.0,4.746460,NaN,NaN,NaN,NaN,NaN,NaN
1,91316.0,91303.0,5.546652,NaN,NaN,NaN,NaN,NaN,NaN
2,91316.0,91324.0,5.743113,NaN,NaN,NaN,NaN,NaN,NaN
3,91316.0,91367.0,5.850308,NaN,NaN,NaN,NaN,NaN,NaN
4,91316.0,90290.0,6.807840,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
23435,NaN,NaN,NaN,NaN,NaN,NaN,91311.0,91748.0,45.804456
23436,NaN,NaN,NaN,NaN,NaN,NaN,91311.0,93252.0,46.472639
23437,NaN,NaN,NaN,NaN,NaN,NaN,91311.0,91773.0,47.034970
23438,NaN,NaN,NaN,NaN,NaN,NaN,91311.0,90740.0,47.754886
23439,NaN,NaN,NaN,NaN,NaN,NaN,91311.0,92801.0,48.454488

In [ ]:
#export to csv
combined_csv.to_csv( "dist_clean_all.csv", index=False)

In [67]:
combined_csv.to_json('dist_clean_all.json', orient='records')

In [77]:
#ATTEMPT #2 FAIL
# https://www.educative.io/edpresso/how-to-combine-multiple-csv-files-in-python

files = ["xab_clean.csv", "xac_clean.csv", "xad_clean.csv"]

# Combine all three CSV files using the concat method
a_b_c = pd.concat([pd.read_csv(f) for f in files], columns=['z1', 'z2', 'd'], join = 'inner')

# Export to csv
a_b_c.to_csv( "ABC.csv", index=False, encoding='utf-8-sig')
data = pd.read_csv("ABC.csv") 
print(data)

TypeError: concat() got an unexpected keyword argument 'columns'

In [78]:
# ATTEMPT #3 SUCCESS

CHUNK_SIZE = 50000
csv_file_list = ["xab_clean.csv", "xac_clean.csv", "xad_clean.csv"]
output_file = "./dist_clean_all.csv"

for csv_file_name in csv_file_list:
    chunk_container = pd.read_csv(csv_file_name, chunksize=CHUNK_SIZE)
    for chunk in chunk_container:
        chunk.to_csv(output_file, mode="a", index=False)

# https://stackoverflow.com/questions/56494140/how-do-i-combine-large-csv-files-in-python

## Convert merged CSV into JSON

In [79]:
# Create dataframe with pandas
mergedJSON = pd.read_csv("./dist_clean_all.csv")

# Add column names
mergedJSON.columns = ['z1', 'z2', 'd']

In [80]:
# Export dataframe to JSON 

mergedJSON.to_json('dist_clean_all.json', orient='records')